develsvai/Project_STM32-firmware/Core/Src/main.c
  /*Configure GPIO pins : TP3_Pin NC2_Pin */
  GPIO_InitStruct.Pin = TP3_Pin|NC2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

  /*Configure GPIO pin : DCMI_PWR_EN_Pin */
  GPIO_InitStruct.Pin = DCMI_PWR_EN_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(DCMI_PWR_EN_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LCD_INT_Pin */
  GPIO_InitStruct.Pin = LCD_INT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(LCD_INT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : ULPI_NXT_Pin */
  GPIO_InitStruct.Pin = ULPI_NXT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(ULPI_NXT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ARDUINO_D4_Pin ARDUINO_D2_Pin EXT_RST_Pin */
  GPIO_InitStruct.Pin = ARDUINO_D4_Pin|ARDUINO_D2_Pin|EXT_RST_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_STP_Pin ULPI_DIR_Pin */
  GPIO_InitStruct.Pin = ULPI_STP_Pin|ULPI_DIR_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : RMII_RXER_Pin */
  GPIO_InitStruct.Pin = RMII_RXER_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(RMII_RXER_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_CLK_Pin ULPI_D0_Pin */
  GPIO_InitStruct.Pin = ULPI_CLK_Pin|ULPI_D0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */

/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument) {
  /* init code for USB_HOST */
	MX_USB_HOST_Init();

  /* init code for LWIP */
	MX_LWIP_Init();
  /* USER CODE BEGIN 5 */

	ip_addr_t server_addr;

	IP_ADDR4(&server_addr, 192, 168, 0, 5);


	// 네트워크 커넥션 생성
	struct netconn *conn = netconn_new(NETCONN_TCP);
	connection.conn = conn;

	if (conn != NULL) {
		// 논블로킹 모드로 설정
//		netconn_set_nonblocking(conn, 1);

		uint8_t data[] = "Network Connection create successfully\n";
		HAL_UART_Transmit(&huart1, data, sizeof(data), HAL_MAX_DELAY);

		err_t err = netconn_connect(connection.conn, &server_addr, SERVER_PORT);
		connection.err = err;

		if (err == ERR_OK) {
			// 연결 성공
			uint8_t data[] = "Network Connection successfully\n";
			HAL_UART_Transmit(&huart1, data, sizeof(data), HAL_MAX_DELAY);

			osThreadDef(myTask02, StartTask02, osPriorityIdle, 0, 1024);
			myTask02Handle = osThreadCreate(osThread(myTask02), NULL);

			// 여기서 추가 작업 수행
		} else if (err == ERR_INPROGRESS) {
			// 연결이 진행 중인 경우
			uint8_t data[] = "Network Connecting...\n";
			HAL_UART_Transmit(&huart1, data, sizeof(data), HAL_MAX_DELAY);
			// 여기서 연결이 완료될 때까지 대기하거나 다른 작업을 수행
		} else {
			// 연결 실패
			uint8_t data[] = "Network Connection failed...\n";
			HAL_UART_Transmit(&huart1, data, sizeof(data), HAL_MAX_DELAY);
			// 오류 처리
		}
		// 연결 시도
	} else {
		// 네트워크 커넥션 생성 실패
		uint8_t data[] = "Network Connection create failed...\n";
		HAL_UART_Transmit(&huart1, data, sizeof(data), HAL_MAX_DELAY);
		// 오류 처리
	}

	/* Infinite loop */
	for (;;) {
		if (data_received_flag) {
			data_received_flag = 0; // 플래그 초기화
			if (strncmp( (char *)rx_buffer, "push", 4) == 0) {
				osThreadDef(netconnConnecti, StartTask03, osPriorityHigh, 0,
						1024);
				netconnConnectiHandle = osThreadCreate(
						osThread(netconnConnecti), NULL);
			} else {
				uint8_t response[] = "Received failed\n";
				HAL_UART_Transmit(&huart1, response, sizeof(response),
						HAL_MAX_DELAY);
			}
		}
		osDelay(100); // 적절한 딜레이 추가
	}

	/* USER CODE END 5 */
}

/* USER CODE BEGIN Header_StartTask02 */

/**
* @brief Function implementing the myTask02 thread.
* @param argument: Not used
* @retval None
*/
/* USER CODE END Header_StartTask02 */
void StartTask02(void const *argument) {
/* USER CODE BEGIN StartTask02 */
/* Infinite loop */

	for (;;) {
		osDelay(1);
	}

	/* USER CODE END StartTask02 */
}

/* USER CODE BEGIN Header_StartTask03 */
const char* lwip_strer(err_t err) {

	switch (err) {
	case ERR_OK:
		return "No error";
	case ERR_MEM:
		return "Out of memory error";
	case ERR_BUF:
		return "Buffer error";
	case ERR_TIMEOUT:
		return "Timeout error";
	case ERR_RTE:
		return "Routing problem";
	case ERR_INPROGRESS:
		return "Operation in progress";
	case ERR_VAL:
		return "Invalid argument";
	case ERR_WOULDBLOCK:
		return "Operation would block";
	case ERR_USE:
		return "Resource in use";
	case ERR_ALREADY:
		return "Already connected";
	case ERR_ISCONN:
		return "Connection already established";
	case ERR_ABRT:
		return "Connection aborted";
	case ERR_RST:
		return "Connection reset";
	default:
		return "Unknown error";
	}
}

/**
 * @brief Function implementing the netconnConnecti thread.
 * @param argument: Not used
 * @retval None
 */
/* USER CODE END Header_StartTask03 */
void StartTask03(void const * argument)
{
  /* USER CODE BEGIN StartTask03 */


	struct netconn *conn = connection.conn;

