develsvai/Project_STM32-firmware/Core/Src/main.c
	err_t err = connection.err;

	uint8_t data[] = "HTTP request start \n";
	HAL_UART_Transmit(&huart1, data, sizeof(data), HAL_MAX_DELAY);


// 구조체 변수 멤버 사용
	/* USER CODE BEGIN 5 */

	if (conn != NULL) {

		if (err == ERR_OK) {

			// 연결이 성공하면 HTTP 요청 전송
			err = netconn_write(conn, http_request, strlen(http_request),
					NETCONN_NOCOPY);

			if (err == ERR_OK) {
				uint8_t data[] = "HTTP request sent successfully.\n\n";
				HAL_UART_Transmit(&huart1, data, sizeof(data), HAL_MAX_DELAY);
//				netconnConnectiHandle = NULL;

				vTaskDelete(NULL);
				// 여기서부터 응답 처리 등 추가 작업 수행
			} else {
				const char *err_msg = "err : ";
				char combined_msg[100]; // 충분한 크기의 버퍼 생성
				strcpy(combined_msg, err_msg); // 첫 번째 문자열 복사
				strcat(combined_msg, lwip_strer(err));
				HAL_UART_Transmit(&huart1, (uint8_t*) err_msg, strlen(err_msg),HAL_MAX_DELAY);
				HAL_UART_Transmit(&huart1, "\n ", strlen("\n"),HAL_MAX_DELAY);
//				netconnConnectiHandle = NULL;
				vTaskDelete(NULL);
			}
		} else {
			const char *err_msg = "err : ";
			char combined_msg[100]; // 충분한 크기의 버퍼 생성
			strcpy(combined_msg, err_msg); // 첫 번째 문자열 복사
			strcat(combined_msg, lwip_strer(err)); // 두 번째 문자열 연결
			HAL_UART_Transmit(&huart1, (uint8_t*) combined_msg, strlen(combined_msg), HAL_MAX_DELAY);
//			netconnConnectiHandle = NULL;
			HAL_UART_Transmit(&huart1, "\n ", strlen("\n"),HAL_MAX_DELAY);
			vTaskDelete(NULL);
		}
		// 연결 해제
//		netconn_delete(conn);
	} else {
		uint8_t data[] = "Failed to create connection.\n";
		HAL_UART_Transmit(&huart1, data, sizeof(data), HAL_MAX_DELAY);
//		netconnConnectiHandle= NULL;
		vTaskDelete(NULL);
	}
	/* Infinite loop */
	for (;;) {
		osDelay(1);
	}

  /* USER CODE END StartTask03 */
}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
